posts/compiling-llvm/index.org
#+BEGIN_COMMENT
.. title: Compiling LLVM
.. slug: compiling-llvm
.. date: 2018-03-21 15:30:55 UTC+02:00
.. tags: 
.. category: 
.. link: 
.. description: 
.. type: text
#+END_COMMENT

* The first time is always the hardest one

After looking through the 2018 GSoC projects LLVM
stands out as the most interesting one for me.

Before it's even time to contact anyone from the
project, I should at least build it first and verify that it passes
any tests they might have.

For two days I couldn't even
build it without my PC running out of RAM in the middle of the build.

"I should get more RAM" - I thought.

Yeah right.
