posts/compiling-llvm/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Compiling LLVM | gramanas &gt;&gt; blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://gramanas.github.io/posts/compiling-llvm/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Anastasis Grammenos">
<meta property="og:site_name" content="gramanas &gt;&gt; blog">
<meta property="og:title" content="Compiling LLVM">
<meta property="og:url" content="https://gramanas.github.io/posts/compiling-llvm/">
<meta property="og:description" content="The first time is always the hardest one


After looking through the 2018 GSoC projects LLVM
stands out as the most interesting one for me.



Before it's even time to contact anyone from the
project,">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-03-21T15:30:55+02:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://gramanas.github.io/">

                <span id="blog-title">gramanas &gt;&gt; blog</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Compiling LLVM</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Anastasis Grammenos
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2018-03-21T15:30:55+02:00" itemprop="datePublished" title="2018-03-21 15:30">2018-03-21 15:30</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">The first time is always the hardest one</h2>
<div class="outline-text-2" id="text-1">
<p>
After looking through the 2018 GSoC projects LLVM
stands out as the most interesting one for me.
</p>

<p>
Before it's even time to contact anyone from the
project, I should at least build it first and verify that it passes
any tests they might have.
</p>

<p>
For two days I couldn't even
build it without my PC running out of RAM in the middle of the build.
</p>

<p>
"I should get more RAM" - I thought.
</p>

<p>
Yeah right.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:anastasis.gramm2@gmail.com">Anastasis Grammenos</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
